Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML10_DFP/3.10.228/svd/ATSAML10D15A.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>NVMCTRL</name>
         <version>U28021.0.0</version>
         <description>Non-Volatile Memory Controller</description>
         <baseAddress>0x41004000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x48</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>NVMCTRL</name>
            <description>Non-Volatile Memory Controller</description>
            <value>9</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control A</description>
               <addressOffset>0x0</addressOffset>
               <size>16</size>
               <access>write-only</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>CMD</name>
                     <description>Command</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                     <enumeratedValues>
                        <name>CMDSelect</name>
                        <enumeratedValue>
                           <name>ER</name>
                           <description>Erase Row - Erases the row addressed by the ADDR register.</description>
                           <value>0x02</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WP</name>
                           <description>Write Page - Writes the contents of the page buffer to the page addressed by the ADDR register.</description>
                           <value>0x04</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPRM</name>
                           <description>Sets the power reduction mode.</description>
                           <value>0x42</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CPRM</name>
                           <description>Clears the power reduction mode.</description>
                           <value>0x43</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PBC</name>
                           <description>Page Buffer Clear - Clears the page buffer.</description>
                           <value>0x44</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INVALL</name>
                           <description>Invalidate all cache lines.</description>
                           <value>0x46</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SDAL0</name>
                           <description>Set DAL=0</description>
                           <value>0x4B</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMDEX</name>
                     <description>Command Execution</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>CMDEXSelect</name>
                        <enumeratedValue>
                           <name>KEY</name>
                           <description>Execution Key</description>
                           <value>0xA5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRLB</name>
               <description>Control B</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RWS</name>
                     <description>NVM Read Wait States</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SLEEPPRM</name>
                     <description>Power Reduction Mode during Sleep</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SLEEPPRMSelect</name>
                        <enumeratedValue>
                           <name>WAKEONACCESS</name>
                           <description>NVM block enters low-power mode when entering sleep.NVM block exits low-power mode upon first access.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WAKEUPINSTANT</name>
                           <description>NVM block enters low-power mode when entering sleep.NVM block exits low-power mode when exiting sleep.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Auto power reduction disabled.</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FWUP</name>
                     <description>fast wake-up</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>READMODE</name>
                     <description>NVMCTRL Read Mode</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>READMODESelect</name>
                        <enumeratedValue>
                           <name>NO_MISS_PENALTY</name>
                           <description>The NVM Controller (cache system) does not insert wait states on a cache miss. Gives the best system performance.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW_POWER</name>
                           <description>Reduces power consumption of the cache system, but inserts a wait state each time there is a cache miss. This mode may not be relevant if CPU performance is required, as the application will be stalled and may lead to increase run time.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DETERMINISTIC</name>
                           <description>The cache system ensures that a cache hit or miss takes the same amount of time, determined by the number of programmed flash wait states. This mode can be used for real-time applications that require deterministic execution timings.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CACHEDIS</name>
                     <description>Cache Disable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRLC</name>
               <description>Control C</description>
               <addressOffset>0x8</addressOffset>
               <size>8</size>
               <resetValue>0x01</resetValue>
               <fields>
                  <field>
                     <name>MANW</name>
                     <description>Manual Write</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVCTRL</name>
               <description>Event Control</description>
               <addressOffset>0xA</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>AUTOWEI</name>
                     <description>Auto Write Event Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AUTOWINV</name>
                     <description>Auto Write Event Polarity Inverted</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0xC</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>NVM Done Interrupt Clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PROGE</name>
                     <description>Programming Error Status Interrupt Clear</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKE</name>
                     <description>Lock Error Status Interrupt Clear</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NVME</name>
                     <description>NVM Error Interrupt Clear</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KEYE</name>
                     <description>Key Write Error Interrupt Clear</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NSCHK</name>
                     <description>NS configuration change detected Interrupt Clear</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x10</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>NVM Done Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PROGE</name>
                     <description>Programming Error Status Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKE</name>
                     <description>Lock Error Status Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NVME</name>
                     <description>NVM Error Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KEYE</name>
                     <description>Key Write Error Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NSCHK</name>
                     <description>NS configuration change detected Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0x14</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>NVM Done</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PROGE</name>
                     <description>Programming Error Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKE</name>
                     <description>Lock Error Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NVME</name>
                     <description>NVM Error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KEYE</name>
                     <description>KEY Write Error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NSCHK</name>
                     <description>NS configuration change detected</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Status</description>
               <addressOffset>0x18</addressOffset>
               <size>16</size>
               <access>read-only</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>PRM</name>
                     <description>Power Reduction Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOAD</name>
                     <description>NVM Page Buffer Active Loading</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>READY</name>
                     <description>NVM Ready</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DALFUSE</name>
                     <description>Debug Access Level Fuse</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DALFUSESelect</name>
                        <enumeratedValue>
                           <name>DAL0</name>
                           <description>NO DEBUG</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DAL2</name>
                           <description>FULL DEBUG</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADDR</name>
               <description>Address</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AOFFSET</name>
                     <description>NVM Address Offset In The Selected Array</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ARRAY</name>
                     <description>Array Select</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>ARRAYSelect</name>
                        <enumeratedValue>
                           <name>FLASH</name>
                           <description>FLASH Array</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATAFLASH</name>
                           <description>DATA FLASH Array</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NVMROWS</name>
                           <description>NVM Rows</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SULCK</name>
               <description>Secure Unlock Register</description>
               <addressOffset>0x20</addressOffset>
               <size>16</size>
               <fields>
                  <field>
                     <name>BS</name>
                     <description>Secure Boot Region</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AS</name>
                     <description>Secure Application Region</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DS</name>
                     <description>Data Secure Region</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLKEY</name>
                     <description>Write Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>SLKEYSelect</name>
                        <enumeratedValue>
                           <name>KEY</name>
                           <description>Write Key</description>
                           <value>0xA5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>NSULCK</name>
               <description>Non-Secure Unlock Register</description>
               <addressOffset>0x22</addressOffset>
               <size>16</size>
               <fields>
                  <field>
                     <name>BNS</name>
                     <description>Non-Secure Boot Region</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANS</name>
                     <description>Non-Secure Application Region</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DNS</name>
                     <description>Non-Secure Data Region</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NSLKEY</name>
                     <description>Write Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>NSLKEYSelect</name>
                        <enumeratedValue>
                           <name>KEY</name>
                           <description>Write Key</description>
                           <value>0xA5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
